brianredbeard/micropython/ports/esp32/boards/DFROBOT_FIREBEETLE2_C6/mpconfigboard.h
// Both of these can be set by mpconfigboard.cmake if a BOARD_VARIANT is
// specified.

#ifndef MICROPY_HW_BOARD_NAME
#define MICROPY_HW_BOARD_NAME "FireBeetle 2 ESP32 C6"
#endif

#ifndef MICROPY_HW_MCU_NAME
#define MICROPY_HW_MCU_NAME "ESP32-C6"
#endif
